app/controllers/articles_controller.rb

    def create
        #data will save on /articles path
        # render plain: params[:article]
        #will provide permit for both parameters due to security reason
        @article = Article.new(article_params)
        # render plain: @article.inspect
        #saving into db
       if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "minakshee bagul"], ["description", "refactoring code"], ["created_at", "2021-03-16 09:52:59.915369"], ["updated_at", "2021-03-16 09:52:59.915369"]]

    def update
        # check to rails c => enter "params" and then edited article will find
        # byebug

        if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "edited Saved into DB"], ["updated_at", "2021-03-16 09:49:18.919126"], ["id", 9]]